#+TITLE: Arduino 
#+HTML_HEAD_EXTRA: <style>pre {font-family: "Times New Roman"; font-size: 130%;}</style>
#+STYLE: <style type="text/css">
#+STYLE:<!--/*--><![CDATA[/*><!--*/
#+STYLE: div.figure { float:left; }
#+STYLE: /*]]>*/-->
#+STYLE: </style>
#+OPTIONS: ^:nil

***** =, +, -, *, /, %
     
#+NAME: operators 
#+BEGIN_SRC C -n :results output
  #include <stdio.h>
  int main(int argc, char *argv[]) {
    int num = 8;
    int den = 3;
    printf("%d / %d = %d\n", num, den, num / den);
    printf("%d %% %d = %d\n",num, den, num % den);
    return 0;
  }
#+END_SRC

#+RESULTS: 
: 8 / 3 = 2
: 8 % 3 = 2

*** pointer
#+NAME: pointer
#+BEGIN_SRC C -n :results output 
#include <stdio.h>

void exchange (int* a, int* b);

int main(int argc, char *argv[]) {

  int a=3, b=5;
  printf("a=%d, b=%d\n", a,b);

  exchange (&a, &b);

  printf("a=%d, b=%d\n", a,b);

  return 0;
}

void exchange (int* a, int* b){
  int temp = *a;
  *a = *b;
  *b = temp;
}

#+END_SRC

#+RESULTS: 
: a=3, b=5
: a=5, b=3


